cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'

tap 'homebrew/boneyard'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'

# First, java
cask 'java' unless system '/usr/libexec/java_home --failfast'

# Packages (some of these are needed for work)
brew 'autoconf'
brew 'automake'
brew 'aws-elasticbeanstalk'
brew 'awscli'
brew 'cairo'
brew 'cassandra'
brew 'coreutils'
brew 'cmatrix'
brew 'czmq'
brew 'findutils'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'fzf'
brew 'gcc5'
brew 'gcc@5'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'git-lfs'
brew 'glib'
brew 'gmp'
brew 'gnu-sed'
brew 'gnupg'
brew 'go'
brew 'gobject-introspection'
brew 'harfbuzz'
brew 'htop'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'isl014'
brew 'isl@0.14'
brew 'jpeg'
brew 'libevent'
brew 'libffi'
brew 'libidn'
brew 'libmpc'
brew 'libpng'
brew 'libsodium'
brew 'libspiro'
brew 'libtiff'
brew 'libtool'
brew 'liquibase'
brew 'memcached'
brew 'moreutils'
brew 'mpfr'
brew 'nginx'
brew 'node'
brew 'openssl'
brew 'pango'
brew 'pcre'
brew 'pixman'
brew 'pkg-config'
brew 'postgresql'
brew 'protobuf'
brew 'python'
brew 'readline'
brew 'redis'
brew 'redis28'
brew 'redis@2.8'
brew 'snappy'
brew 'sqlite'
brew 'toilet'
brew 'tmux'
brew 'ttfautohint'
brew 'tree'
brew 'sl'
brew 'wget'
brew 'xz'
brew 'zeromq'
brew 'z'

# Apps: Cask
cask 'atom'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
case 'google-drive'
cask 'iterm2'
cask 'screenhero'
cask 'spectacle'
cask 'sourcetree'
cask '1password'
cask 'sketch'
cask 'webstorm'
cask 'spotify'
cask 'slack'
